tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32625/Include/max32625.h
/*******************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-05-18 16:52:09 -0500 (Wed, 18 May 2016) $
 * $Revision: 22911 $
 *
 ******************************************************************************/

#ifndef _MAX32625_H_
#define _MAX32625_H_

#include <stdint.h>

#ifndef  FALSE
#define  FALSE      (0)
#endif

#ifndef  TRUE
#define  TRUE       (1)
#endif

/* COMPILER SPECIFIC DEFINES (IAR, ARMCC and GNUC) */
#if defined ( __GNUC__ )
#define __weak __attribute__((weak))

#elif defined ( __CC_ARM)
 
#define inline __inline
#pragma anon_unions

#endif

typedef enum {
    NonMaskableInt_IRQn    = -14,
    HardFault_IRQn         = -13,
    MemoryManagement_IRQn  = -12,
    BusFault_IRQn          = -11,
    UsageFault_IRQn        = -10,
    SVCall_IRQn            = -5,
    DebugMonitor_IRQn      = -4,
    PendSV_IRQn            = -2,
    SysTick_IRQn           = -1,

    /* Device-specific interrupt sources (external to ARM core)                  */
    /*                         table entry number                                */
    /*                         ||||                                              */
    /*                         ||||  table offset address                        */
    /*                         vvvv  vvvvvv                                      */

    CLKMAN_IRQn      = 0,   /* 0x10 0x0040,CLKMAN                                */
    PWRMAN_IRQn      = 1,   /* 0x11 0x0044 PWRMAN                                */
    FLC_IRQn         = 2,   /* 0x12 0x0048 Flash Controller                      */
    RTC0_IRQn        = 3,   /* 0x13 0x004C RTC Counter match with Compare 0      */
    RTC1_IRQn        = 4,   /* 0x14 0x0050 RTC Counter match with Compare 1      */
    RTC2_IRQn        = 5,   /* 0x15 0x0054 RTC Prescaler interval compare match  */
    RTC3_IRQn        = 6,   /* 0x16 0x0058 RTC Overflow                          */
    PMU_IRQn         = 7,   /* 0x17 0x005C Peripheral Management Unit (PMU/DMA)  */
    USB_IRQn         = 8,   /* 0x18 0x0060 USB                                   */
    AES_IRQn         = 9,   /* 0x19 0x0064 AES                                   */
    MAA_IRQn         = 10,  /* 0x1A 0x0068 MAA                                   */
    WDT0_IRQn        = 11,  /* 0x1B 0x006C Watchdog 0 timeout                    */
    WDT0_P_IRQn      = 12,  /* 0x1C 0x0070 Watchdog 0 pre-window (fed too early) */
    WDT1_IRQn        = 13,  /* 0x1D 0x0074 Watchdog 1 timeout                    */
    WDT1_P_IRQn      = 14,  /* 0x1E 0x0078 Watchdog 1 pre-window (fed too early) */
    GPIO_P0_IRQn     = 15,  /* 0x1F 0x007C GPIO Port 0                           */
    GPIO_P1_IRQn     = 16,  /* 0x20 0x0080 GPIO Port 1                           */
    GPIO_P2_IRQn     = 17,  /* 0x21 0x0084 GPIO Port 2                           */
    GPIO_P3_IRQn     = 18,  /* 0x22 0x0088 GPIO Port 3                           */
    GPIO_P4_IRQn     = 19,  /* 0x23 0x008C GPIO Port 4                           */
    GPIO_P5_IRQn     = 20,  /* 0x24 0x0090 GPIO Port 5 (Unused)                  */
    GPIO_P6_IRQn     = 21,  /* 0x25 0x0094 GPIO Port 6 (Unused)                  */
    TMR0_0_IRQn      = 22,  /* 0x26 0x0098 Timer 0 (32-bit, 16-bit #0)           */
    TMR0_1_IRQn      = 23,  /* 0x27 0x009C Timer 0         (16-bit #1)           */
    TMR1_0_IRQn      = 24,  /* 0x28 0x00A0 Timer 1 (32-bit, 16-bit #0)           */
    TMR1_1_IRQn      = 25,  /* 0x29 0x00A4 Timer 1         (16-bit #1)           */
    TMR2_0_IRQn      = 26,  /* 0x2A 0x00A8 Timer 2 (32-bit, 16-bit #0)           */
    TMR2_1_IRQn      = 27,  /* 0x2B 0x00AC Timer 2         (16-bit #1)           */
    TMR3_0_IRQn      = 28,  /* 0x2C 0x00B0 Timer 3 (32-bit, 16-bit #0)           */
    TMR3_1_IRQn      = 29,  /* 0x2D 0x00B4 Timer 3         (16-bit #1)           */
    TMR4_0_IRQn      = 30,  /* 0x2E 0x00B8 Timer 4 (32-bit, 16-bit #0)           */
    TMR4_1_IRQn      = 31,  /* 0x2F 0x00BC Timer 4         (16-bit #1)           */
    TMR5_0_IRQn      = 32,  /* 0x30 0x00C0 Timer 5 (32-bit, 16-bit #0)           */
    TMR5_1_IRQn      = 33,  /* 0x31 0x00C4 Timer 5         (16-bit #1)           */
    UART0_IRQn       = 34,  /* 0x32 0x00C8 UART 0                                */
    UART1_IRQn       = 35,  /* 0x33 0x00CC UART 1                                */
    UART2_IRQn       = 36,  /* 0x34 0x00D0 UART 2                                */
    UART3_IRQn       = 37,  /* 0x35 0x00D4 UART 3 (Unused)                       */
    PT_IRQn          = 38,  /* 0x36 0x00D8 Pulse Trains                          */
    I2CM0_IRQn       = 39,  /* 0x37 0x00DC I2C Master 0                          */
    I2CM1_IRQn       = 40,  /* 0x38 0x00E0 I2C Master 1                          */
    I2CM2_IRQn       = 41,  /* 0x39 0x00E4 I2C Master 2 (Unused)                 */
    I2CS_IRQn        = 42,  /* 0x3A 0x00E8 I2C Slave                             */
    SPIM0_IRQn       = 43,  /* 0x3B 0x00EC SPI Master 0                          */
    SPIM1_IRQn       = 44,  /* 0x3C 0x00F0 SPI Master 1                          */
    SPIM2_IRQn       = 45,  /* 0x3D 0x00F4 SPI Master 2                          */
    SPIB_IRQn        = 46,  /* 0x3E 0x00F8 SPI Bridge (Unused)                   */
    OWM_IRQn         = 47,  /* 0x3F 0x00FC 1-Wire Master                         */
    AFE_IRQn         = 48,  /* 0x40 0x0100 Analog Front End, ADC                 */
    SPIS_IRQn        = 49,  /* 0x41 0x0104 SPI Slave                             */
    MXC_IRQ_EXT_COUNT,
} IRQn_Type;

